/* Shared module download status view - Play button */
"DownloadView_Play" = "Spill";

/* Shared module downlaod status view - Dismiss button */
"DownloadView_Dismiss" = "Lukk";

/* Local collection of modules tab title*/
"TabBar_Local" = "Samling";

/* Playlist tab title */
"TabBar_Playlist" = "Spilleliste";

/* Search tab title */
"TabBar_Search" = "Søk";

/* Radio tab title*/
"TabBar_Radio" = "Radio";

/* About tab title */
"TabBar_About" = "Om";

/* Local Import messages */
"Local_Import_One" = "1 modul importert";

"Local_Import_Multiple" = "%@ moduler importert";

"Local_Import_None" = "Ingen moduler importiert";

"Local_Import_None" = "Ingen moduler importert";
"Local_Import_Already_In" = "%@ allerede i databasen";
"Local_Import_Unknown" = "%@ ukjent";
"Local_Import_Imported" = "%@ importert";
"Local_Import_Assign" = "Tildel komponist";
"Local_Import_Cancel" = "Avbryt import";
"Local_Import_Composer" = "Komponistnavn";

"Local_Database_Error_Title" = "Databasefeil";
"Local_Database_Error_Text" = "Dessverre mislyktes åpningen av databasen. Dette er en uopprettelig feil, en ny database er opprettet. \n\n4champ kan prøve å legge til de eksisterende lokale modulene tilbake i databasen. Ønsker du å prøve det?";
"Local_Database_Error_Try_Fix" = "Ja, vær så snill!";
"Local_Database_Error_Nvm" = "Glem det";


/* Local modules view: info note on local modules tab when no modules available */
"ModulesView_NoModules" = "Ingen låter i samlingen. Søk på låter med søkefunksjonen eller sjekk ut radio.";

"PlaylistView_NoModules" = "Ingen moduler på spillelisten. Du kan legge til moduler i en spilleliste med et langt trykk på en modul i hvilken som helst visning.";

/* Local modules view: Module size sort selector */
"ModuleInfo_Size" = "Størrelse";

/* Local modules view: Composer handle selector in list sort */
"ModuleInfo_Handle" = "Artist";

"ModuleInfo_Type" = "Type";


/* Local modules view: Search filter toggle button title */
"ModulesView_Filter" = "Filter";

/* Search view: Module tab title */
"G_Module" = "Låt";

/* Search view: Texts tab title */
"G_Texts" = "Texter";

/* Search view: Composer tab title */
"SearchView_Composer" = "Artist";

/* Search view: Group tab title */
"G_Group" = "Gruppe";

/* Search failed info label */
"Error_SearchFailed" = "Søk mislyktes. Tjeneren svarer ikke eller du mangler internettforbindelse. Prøv igjen senere.";

/* Info level dialog title */
"G_Note" = "Melding";

/* OK button in dialog */
"G_OK" = "OK";

/* Cannot lock radio playlist title */
"Error_CannotLockRadioPlaylist" = "Du kan ikke låse radiospillelisten.";

/* Cannot lock default playlist title */
"Error_CannotLockDefaultPlaylist" = "Du kan ikke låse standardspillelisten.";

/* Playlist title on playlists view. Shows playlist name + count of modules */
"PlaylistView_PlaylistNameAndCount" = "Spilleliste: %1$@ (%2$ld)";

/* Label shown on playlist view when no modules */
"PlaylistView_PlaylistEmpty" = "Spillelisten er tom. Legg til fra Samling eller Søk.";

/* Radio status text
 Shown on playlist page when radio is on */
"G_RadioOn" = "Radio er på";

/* Playlist view: Default playlist button title */
"PlaylistView_DefaultPlaylist" = "Standardspilleliste";

/* Clear playlist dialog clear button */
"G_Clear" = "Tøm";

/* Clear playlist dialog title */
"PlaylistView_ClearDialog_Title" = "Tøm spilleliste";

/* Add module to playlist selector title*/
"PlaylistSelector_Title" = "Legg til på spilleliste";

/* Add module to playlist button*/
"PlaylistSelector_Add" = "Legg til";

/* Module table: Error show if play attempted while playlist is locked
 Playlist locked dialog message
 playlist locked info message */
"Error_CurrentPlaylistLocked" = "Spillelisten er låst.";

/* Clear playlist dialog message */
"PlaylistView_ClearDialog_Message" = "Vil du tømme spillelisten?";

/* No comment provided by engineer. */
"G_Cancel" = "Avbryt";

/* untitled playlist default title */
"G_Untitled" = "Uten navn";

/* About view: Buy full version button title */
"AboutView_Buy" = "Kjøp fullversjon";

"About_Licenses" = "Licenser";
"About_Copyrights" = "Opphavsrett og tillatelser";

"AboutView_Title" = "Om champion-tracker";

/* About view: Full version price and description */
"AboutView_FullVersionInfo" = "Fullversjonen (%@) har støtte for bakgrunnsavspilling";

/* About view: Full version not purchased message */
"AboutView_NotPurchased" = "Fullversjon ikke kjøpt!";

/* About view: Restore complete dialog title */
"AboutView_RestoreComplete" = "Gjenoppretting fullført";

/* About view: Restore purchases button title */
"AboutView_Restore" = "Gjenopprett kjøp";

/* About view: Restore button title while restore in progress */
"AboutView_Restoring" = "Gjenoppretter...";

/* About view: Purchase button title while purchase in progress */
"AboutView_Purchasing" = "Kjøper...";

/* Local modules view: First use data collection consent dialog title */
"AnalyticsDialog_Title" = "Innsamling av brukerdata";

/* Local modules view: First use data collection consent dialog message */
"AnalyticsDialog_Message" = "champion-tracker bruker Google Analytics til å samle inn anonym brukerstatistikk. Ingen personlig informasjon blir lagret. Vil du tillate innsamling av data?";

/* Local modules view: Data collection consent dialog no thanks button title */
"AnalyticsDialog_NoThanks" = "Nei takk";

/* Local modules view: Data collection consent more info button title */
"AnalyticsDialog_MoreInfo" = "Mer informasjon";

/* Lock-screen: playing mod by author title
 Shared module download view: Module author and name */
"LockScreen_Playing" = "%1$@ av %2$@";

/* Lock-screen: radio playlist name */
"LockScreen_Radio" = "champion-tracker radio";

/* Share module default content modname, author */
"Share_DefaultMessage" = "%1$@ av %2$@ #champion-tracker #NowPlaying ";

/* No comment provided by engineer. */
"Share_AppMessage" = "champion-tracker App - Amiga-musikk i din egen lomme";

/* Radio view: Prefetch failed title */
"Radio_FetchFailed" = "Bufring mislyktes!";

/* Radio view: Radio status disclaimer */
"Radio_RadioIsOff" = "Radio er av";

/* Radio Status off
 Radio status off
 Radio view: Radio status off */
"Radio_StatusOff" = "Radio av";

/* Radio status on
 Radio view: Radio status on */
"Radio_StatusOn" = "Radio er på";

/* Radio view: Next module label */
"Radio_NextUp" = "Neste:";

"Radio_Previous" = "Tidligere:";

"Radio_NByN" = "%1$@ av %2$@";

/* Radio view: Fetching status label */
"Radio_Fetching" = "Bufrer...";

/* Radio channel: All (whole AMP database) */
"Radio_All" = "Alt";

/* Radio channel: New (Latest AMP additions) */
"Radio_New" = "Nytt i AMP";

"Radio_New_Count" = "Nytt (%@)";

/* Radio channel: Local collection (offline play) */
"Radio_Local" = "Samling";

"Radio_Custom" = "Tilpasset";

"Connectivity_Err" = "Det er et problem å koble til amp.dascene.net. Du kan bruke programmet i frakoblet modus og spille av lokale låter, men søke og radio funksjoner vil ikke virke. Sjekk champion-tracker Mastodon feed for mulige oppdateringer om status.";

"Social_Check" = "champion-tracker på Mastodon";

/* Radio view: Label shown if local channel selected but no local modules in database */
"Radio_NoLocalModules" = "Ingen låter i lokal samling";

"Radio_NoSelection" = "Konfigurer tilpasset kanal via søkefanen";

/* Radio view: annotation on modules that are in local collection*/
"Radio_InLocalCollection" = "I lokal samling";

"Radio_NotificationButton" = "Varsle meg når nye moduler legges";

"Radio_Notification" = "%@ nye moduler i champion-tracker Radio";

"Radio_NotificationButton_Settings" = "Varslingsinnstillinger";


"Notifications_Title" = "Varslinger";
"Notifications_BackgroundFetchDisabled" = "champion-tracker må bakgrunn hente tillatelse til å varsle om nye moduler. Du kan aktivere dette i appinnstillingene";
"Notifications_Disabled" = "Du er registrert for varslinger, men varslene deaktivert i appinnstillingene";

/* Module download: Unsupported format info label */
"Search_UnsupportedFormat" = "Dette filformatet støttes ikke";

/* Module table: nondownloaded module title
 Non-downloaded module overlay title */
"Search_TapToLoad" = "Trykk for å laste ned...";

/* Downloading module info label
 Downloading module status label */
"Search_Downloading" = "Laster ned...";

/* Module table: pending download label title */
"Search_DownloadPending" = "Nedlasting på vent...";

/* Search did not find anything info label */
"Search_NoResult" = "Ingen resultater. Prøv å søke på noe annet";

"Search_RadioMessage_Add" = "Kanal '%1$@' startet med %2$d moduler";
"Search_RadioMessage_Append" = "%2$d moduler lagt til i kanal '%1$@'";

/* Playlist view: Local database cleanup dialog button for deleting modules */
"Dialog_Delete" = "Slett";

"ModulesView_Delete" = "Slett fra samling";
"NP_AddToPlaylist" = "Legg til i spilleliste...";
"NP_Share" = "Dele...";

"PlaylistView_Remove" = "Slett fra spilleliste";

"SearchView_Remove" = "Slett fra samling";

/* module table: error shown if attempting to delete module that is on a locked playlist */
"Error_PlaylistLocked" = "Låten er på en låst spilleliste";

/* Download failed for composer modules list info label */
"Error_ModuleListFailed" = "Spillelistesøk mislyktes. Tjeneren svarer ikke eller du mangler internettforbindelse. Prøv igjen senere.";

/* Module table: Error shown when data indicates restricted download */
"Error_ComposerDisabled" = "Artisten har slått av nedlasting av denne låten";

/* Playlist view: Local database cleanup message */
"Dialog_DeleteOrKeep" = "Du har %lu låter i din samling som ikke har blitt favorittmarkert eller lagt til i en spilleliste. Vil du beholde eller slette dem?";

/* Keep module button title
 Playlist view: Local database cleanup dialog button for keeping modules */
"Dialog_Keep" = "Behold";

/* Clean up playlist dialog title
 Playlist view: Local database cleanup dialog title */
"Dialog_Cleanup_Title" = "Automatisk sletting";

/* Clean up playlist dialog message */
"Dialog_DeleteOrKeep_Single" = "Når du sletter denne låten fra denne spillelisten, er den lenger ikke på noen spillelister. Vil du beholde eller slette den?";

/* Module table: Error shown if module cannot be downloaded */
"Error_DownloadFailed" = "Nedlasting mislyktes. Prøv igjen senere.";

"Error_DownloadFailed_2" = "Hmm... det ser ut til at denne låten ikke kan lastes ned akkurat nå.";

"Error_PlaybackFailed" = "Beklager, kan ikke spille av denne filen.";

/* Radio view: Title */
"RadioView_Title" = "4CHAMP RADIO";

/* Dialogs: Error title */
"Dialog_Error" = "Problem";

/* Info level message title */
"Dialog_Info" = "Melding";

/* Dialogs: Product information not found message */
"Dialog_ProductInfoNotFound" = "Produktinformasjon ikke funnet";

/* Shared module download view / title when complete */
"ShareDialog_DownloadComplete" = "Nedlasting fullført";

/* Module cell: Download failed transient title */
"Search_DownloadFailed" = "Nedlasting mislyktes";

/* Shared module download view: Download failed label */
"ShareDialog_DownloadFailed" = "Nedlasting mislyktes";

"AboutView_ThankYou" = "Takk, for at du kjøpte fullversjon";

"AboutView_Share" = "Tips vennene dine om champion-tracker";

"PlaylistView_Playlists" = "Spillelister";

"PlaylistView_PlaylistName" = "Navn på spilleliste";

"AboutView_Info" = "champion-tracker - Amiga-musikk i din egen lomme. \n\n4champ kobler din enhet til Amiga Music Preservation sin nettside (http://amp.dascene.net) og lar deg søke på låter og artister i AMP-databasen. \n\n champion-tracker bruker LibOpenMPT, UADE og HivelyTracker for avspilling.\n\n champion-tracker for iOS-enheter \n© Aleksi Sitomaniemi";

"AboutView_Local" = "Nedlastede låter kan finnes i Samling. Trykk på en låt for å spille av. Langt trykk vil åpne en meny for å legge låten i en spilleliste.\n\nSkyv til venstre for å slette låten. \n\nDu kan sortere låter etter type, artist, navn, størrelse eller favorittmarkering. Bruk filter-knappen for å søke kjapt på en låt.";

"AboutView_Legal" = "champion-tracker bruker Amiga Music Preservation Database med tillatelse gitt av eierne av tjenesten.\n\nCopyrights på musikk hører til komponistene. Hvis du tror at tilgjengeligheten av en gitt musikkfil i dette programmet krenker rettighetene til en tredje part, kontakt AMP ansatte gjennom amp.dascene.net for en rask tilbaketrekking av nevnte musikkfilen .";

"AboutView_Search" = "Bruk søkefunksjonen til å finne låter. Du kan søke etter artist, gruppe, navn eller tekster i modul . Dersom gruppesøket finner kun én gruppe, vil alle artister på listen bli ramset opp. Dersom det blir funnet flere grupper vil alle gruppene ramses opp, og ved å trykke på en av gruppene vil alle artister i gruppen bli ramset opp. \n\nITrykk på en låt for å laste den ned.\n\nSøkeresultater header har en knapp for å laste ned alle resultater på en gang. Hvis du ønsker å holde modulen, trykk lagre ikonet ved siden av modulnavnet eller angi modulen som favoritt ved å trykke på stjerneikonet. Du kan også starte en radiostasjon fra søkeresultatene når det finnes moduler i resultatlisten.";

"AboutView_Playlists" = "Spilleliste-fanen viser nåværende spilleliste. Et langt trykk lar deg legge til låten i en valgfri spilleliste.\n\nI spillelistemodus kan du opprette og endre nye spillelister. Du kan også  bytte spillemodus (sortert/shuffle). \n\nSkyv til venstre for å slette låten fra spillelisten (ikke fra Samling).";

"AboutView_Radio" = "champion-tracker radio spiller av sanger fra AMP-databasen i tilfeldig rekkefølge (shuffle play).\n\nHvis du liker en låt kan du favorittmarkere den ved å trykke på stjernen eller legge den til i en spilleliste med et langt trykk.\n\nDu kan velge mellom fire kanaler: Alt (hele AMP-databasen i tilfeldig rekkefølge),  Nytt (nylig lagt til i AMP-databasen), Samling (fra lokal samling), Tilpasset (opprettet fra et søkeresultat)";

"AboutView_Social" ="champion-tracker er på Mastodon! Følg @champion-tracker@mastodon.social for nyheter, kommende oppdateringer, problemer osv. Vi legger også ut låter som du kan laste ned til din samling. Trykk her for å følge.";

"SettingsView_Title" = "Innstillinger";

"Settings_StereoSeparation" = "Stereoseparasjon (%@%%)";
"Settings_Effects" = "Effekter";
"Settings_Housekeeping" = "Automatisk sletting";
"Settings_HousekeepingDescription" = "Velg hvordan champion-tracker skal forholde seg til ikke-festede (ikke favorittmarkert, ikke på spillelister) når spillelisten tømmes";
"Settings_AlwaysAsk" = "Spør før sletting";
"Settings_Keep" = "Behold alt";
"Settings_DeleteNonPinned" = "Slett ikke-festede";
"Settings_AnalyticsTitle" = "Innsamling av brukerdata";
"Settings_AnalyticsOK" = "Den er grei";
"Settings_AnalyticsDetails" = "Informasjon om innsamling av brukerdata";
"Settings_EffectsOnOff" = "Effekter på/av";
"Settings_PreviewMode" = "Forhåndsvisningmodus";
"Settings_Interpolation" = "Sample interpolasjon";
